2Cylinder_Re75/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    INLET
    {
        type            patch;
        nFaces          306;
        startFace       126015;
    }
    OUTLET
    {
        type            patch;
        nFaces          306;
        startFace       126321;
    }
    TOP
    {
        type            wall;
        inGroups        1(wall);
        nFaces          211;
        startFace       126627;
    }
    BOTTOM
    {
        type            wall;
        inGroups        1(wall);
        nFaces          211;
        startFace       126838;
    }
    SIDE1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          63316;
        startFace       127049;
    }
    SIDE2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          63316;
        startFace       190365;
    }
    PRISM1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       253681;
    }
    PRISM2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       253781;
    }
)

// ************************************************************************* //
